{
  "locale": "pt",
  "theme": {
    "light": "Claro",
    "dark": "Escuro",
    "system": "Sistema"
  },
  "header": {
    "home": "Inicio",
    "about": "Sobre",
    "projects": "Projetos",
    "skills": "Habilidades",
    "experiences": "Experiências",
    "contact": "Contato",
    "resume": "Curriculo",
    "themeButtonTitle": "Trocar o tema",
    "localeButtonTitle": "Trocar o idioma",
    "together": "Vamos construir algo incrível juntos"
  },
  "resume": {
    "link": "/pt/cv",
    "redirectLink": "https://drive.google.com/file/d/1i5hzldbSE5s_R1N9RdavBiseNWIA-h8H/view?usp=sharing"
  },
  "home": {
    "greetings": "Olá👋,",
    "me": "Meu nome é",
    "myName": "Matheus Brito",
    "whatIAm": "Eu sou um",
    "whatIAmList": [
      "Desenvolvedor Backend",
      "Desenvolvedor Frontend",
      "Engenheiro de Software"
    ],
    "getInTouch": "Entre em contato"
  },
  "about": {
    "title": "../sobre",
    "subtitle": "Quem sou eu",
    "description": "Sou um Engenheiro de Software Full Stack focado na construção de aplicações Web escaláveis e de alta performance. Tenho experiência no desenvolvimento de interfaces modernas de front-end utilizando TypeScript, React e Angular, além de sistemas robustos de back-end com C#, .NET e ASP.NET. Sigo os princípios SOLID, a arquitetura CLEAN e escrevo código sustentável, testável e preparado para escalar no longo prazo.\nMinha experiência abrange bancos de dados SQL (PostgreSQL, MySQL, SQL Server) e NoSQL (MongoDB, Redis), bem como o design e a implementação de microsserviços e arquiteturas orientadas a eventos. Já trabalhei com serviços em nuvem na Azure e integrei diversas APIs de terceiros para habilitar funcionalidades como mensagens, conectividade social e automação.\nTambém estou explorando como a inteligência artificial pode potencializar automações e melhorar a experiência do usuário em diferentes partes de uma aplicação.\nO que me motiva é o desafio de resolver problemas reais por meio de soluções limpas e escaláveis seja no front-end, back-end ou infraestrutura. Estou em constante aprendizado, me adaptando a novas tecnologias e sempre aberto a oportunidades que me façam crescer e entregar software de impacto."
  },
  "skills": {
    "title": "../habilidades",
    "subtitle": "O que eu posso fazer",
    "front-end": "Front end",
    "back-end": "Back end",
    "database": "Banco de dados",
    "cloud": "Nuvem & Infra",
    "others": "Outros",
    "experience": "de experiência"
  },
  "experiences": {
    "title": "../experiências",
    "subtitle": "Onde eu trabalhei",
    "skills": "Habilidades",
    "positions": {
      "evolveIt": "Engenheiro de software",
      "techSolutio": "Desenvolvedor de Software",
      "fransciscoFarm": "Desenvolvedor de Software",
      "dantasEletro": "Desenvolvedor de Software",
      "capitalNerd": "Desenvolvedor de Software"
    },
    "descriptions": {
      "evolveIt": "Desenvolveu uma plataforma SaaS multi-tenant focada em comunicação com clientes e automação. Integrou canais de mensagens como SMS, Email, WhatsApp e Facebook com IA para melhorar a qualidade das interações. Construiu APIs escaláveis e interfaces responsivas alinhadas com os designs do Figma.",
      "techSolutio": "Implementou um sistema unificado para processar falhas de telecomunicação em diversos tipos de equipamentos. Desenvolveu microsserviços escaláveis e orientados a eventos utilizando comunicação assíncrona para melhorar o tempo de restauração dos serviços.",
      "fransciscoFarm": "Aprimorou o controle de acesso e a rastreabilidade dos usuários, melhorando a autenticação e implementando um sistema de auditoria para registrar ações. Desenvolveu um aplicativo de inventário offline usando Flutter, com sincronização automática dos dados e leitura de QR Code para agilizar operações em locais sem internet.",
      "dantasEletro": "Modernizou fluxos de vendas legados com uma ferramenta de automação que simplificou a experiência do usuário e reduziu etapas operacionais. Atuou tanto no backend quanto no frontend utilizando .NET e React.",
      "capitalNerd": "Manteve e aprimorou um sistema ERP personalizado, reduzindo o tempo de resolução de bugs e melhorando a performance. Criou tarefas em segundo plano com Hangfire e contribuiu para o frontend baseado em Angular."
    }
  },
  "contact": {
    "title": "../contato",
    "subtitle": "Entre em contato",
    "labels": {
      "name": "Nome",
      "email": "Email",
      "message": "Mensagem"
    },
    "errors": {
      "name": "O nome precisa ter no minimo 3 caracters.",
      "email": "Email invalidoo.",
      "message": "A mensangem precisa ter no minimo 3 caracters.",
      "request": "Erro ao tentar enviar email."
    },
    "success": {
      "request": "Email enviado com sucessoo."
    },
    "send": "Enviar",
    "sending": "Enviando..."
  }
}
